tap "charmbracelet/tap"
tap "fsouza/prettierd"
tap "fwartner/tap"
tap "getsentry/tools"
tap "homebrew/bundle"
tap "homebrew/services"
tap "isacikgoz/taps"
tap "jesseduffield/lazygit"
tap "khanhas/tap"
tap "koekeishiya/formulae"
tap "shopify/shopify"
tap "vitorgalvao/tiny-scripts"
tap "wez/wezterm"
# Run your GitHub Actions locally
brew "act"
# Plugin manager for zsh, inspired by oh-my-zsh and vundle
brew "antigen"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Platform built on V8 to build network applications
brew "node"
# AST-based pattern checker for JavaScript
brew "eslint"
# Modern, maintained replacement for ls
brew "eza"
# Validating, recursive, caching DNS resolver
brew "unbound"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Create thumbnails for your video files
brew "ffmpegthumbnailer"
# Command-line fuzzy finder written in Go
brew "fzf"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Colorize logfiles and command output
brew "grc"
# GNU grep, egrep and fgrep
brew "grep"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# LLVM's OpenMP runtime library
brew "libomp", link: true
# Generic library support script
brew "libtool"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Powerful, lightweight programming language
brew "lua"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Mac App Store command-line interface
brew "mas"
# Open source relational database management system
brew "mysql"
# Node version management
brew "n"
# Fast, highly customisable system info script
brew "neofetch"
# Fast, disk space efficient package manager
brew "pnpm"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Cross-shell prompt for astronauts
brew "starship"
# Opinionated Lua code formatter
brew "stylua"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Command-line interface for Vercel
brew "vercel-cli"
# Show the current WiFi network password
brew "wifi-password"
# Copy terminal output to clipboard
brew "yank"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Next-generation plugin manager for zsh
brew "zplug"
# UNIX shell (command interpreter)
brew "zsh"
# Sentry command-line client for some generic tasks
brew "getsentry/tools/sentry-cli"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
# A CLI tool to build for the Shopify platform
brew "shopify/shopify/shopify-cli"
# Voice and text chat software
cask "discord"
# Collaborative team software
cask "figma"
# Web browser
cask "google-chrome"
# GraphQL IDE for better development workflows
cask "graphql-playground"
# Tool to optimise images to a smaller size
cask "imageoptim"
# Open-source screen recorder built with web technology
cask "kap"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# App to write, plan, collaborate, and get organised
cask "notion"
# Font manager that helps preview, install, sync and manage fonts
cask "rightfont"
# Video chat, voice call and instant messaging application
cask "skype"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Open-source code editor
cask "visual-studio-code"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Video communication and virtual meeting platform
cask "zoom"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
mas "‎WhatsApp", id: 310633997
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "ionutvmi.path-autocomplete"
vscode "janisdd.vscode-edit-csv"
vscode "mquandalle.graphql"
vscode "tonka3000.raycast"
vscode "unifiedjs.vscode-mdx"
vscode "waderyan.gitblame"
vscode "xyc.vscode-mdx-preview"
